// Подарки Деда Мороза
// (Время: 0,5 сек. Память: 16 Мб Сложность: 27%)
// Ириска весит X грамм, мандарин – Y грамм, пряник – Z грамм.

// Требуется написать программу, которая определит, сколько различных вариантов подарков весом ровно W грамм может сделать Дед Мороз.

// Входные данные
// В единственной строке входного файла INPUT.TXT содержится четыре целых числа X, Y, Z и W (1 ≤ X, Y, Z ≤ 100, 1 ≤ W ≤ 1000).

// Выходные данные
// Выходной файл OUTPUT.TXT должен содержать одно целое число – количество вариантов подарков.

// Пример
// №	INPUT.TXT		OUTPUT.TXT
// 1	10 25 15 40			3
#include <bits/stdc++.h>
using namespace std;
int sum(int *arr,int x,int c){
	for (int i =0;i<3;i++){
		
	}
}
int main(int argc, char const *argv[])
{
	int arr[3];
	int x;
	cin >> arr[0] >> arr[1] >> arr[2] >> x;

	return 0;
}